{
  "page":
  {
    "title": "Christopher Hitchens Tribute Page",
    "description": "FCC Challenge by Daniel Varvara"
  },
  "home":
  {
    "title": "Christopher Eric Hitchens",
    "subtitle": "(13 April 1949 – 15 December 2011)",
    "quote": "Human decency is not derived from religion. It precedes it.",
    "image": "component/image/top.jpg",
    "personal":
    {
      "title": "Personal life",
      "content": [
        "Hitchens was married twice, first to Eleni Meleagrou, a Greek Cypriot, in a Greek Orthodox church in 1981; the couple had a son, Alexander, and a daughter, Sophia. They divorced in 1989. From February 1990, Hitchens's girlfriend was reported as being Carol Blue, an American screenwriter. In 1991, Hitchens married Blue in a ceremony held at the apartment of Victor Navasky, editor of The Nation. They had a daughter, Antonia.",
        "Hitchens's father, Eric Hitchens, was a commander in the British Royal Navy. Hitchens often referred to his father as simply the 'Commander'. Hitchens's father was deployed on HMS Jamaica which took part in the sinking of the German battleship Scharnhorst in the Battle of the North Cape on 26 December 1943. Christopher Hitchens would refer to his father's contribution to the war: 'Sending a Nazi convoy raider to the bottom is a better day's work than any I have ever done.' He also stated that 'the remark that most summed him [his father] up was the flat statement that the war of 1939 to 1945 had been 'the only time when I really felt I knew what I was doing.'",
        "Hitchens's mother, Yvonne, died in Athens in 1973 when, despite first reports in The Times that she had been murdered, it was later concluded that her death had been the result of an apparent suicide pact with her boyfriend, Reverend Timothy Bryan. Hitchens travelled to Athens to identify his mother's body.",
        "Hitchens's younger brother by two-and-a-half years, Peter Hitchens, is a Christian and socially conservative journalist, although, like his brother, he had been a Trotskyist in the 1970s.",
        "Hitchens smoked tobacco and drank hard alcohol frequently. His preferred brand of cigarette was Rothmans. His preferred whisky was Johnnie Walker Black."
      ]
    },
    "careerUk":
    {
      "type": "article",
      "title": "Journalistic career in the UK (1970–1981)",
      "content": [
        "Hitchens began working as a correspondent for the magazine International Socialism, published by the International Socialists, the forerunners of today's British Socialist Workers Party. This group was broadly Trotskyist, but differed from more orthodox Trotskyist groups in its refusal to defend communist states as 'workers' states'. Their slogan was 'Neither Washington nor Moscow but International Socialism'.",
        "Hitchens left Oxford with a third-class degree. In 1971 he went to work at the Times Higher Education Supplement where he served as a social science correspondent. Hitchens admitted that he hated the position, and was fired after six months in the job. Next he was a researcher for ITV's Weekend World. In 1973 he went to work for the New Statesman, where his colleagues included the authors Martin Amis, whom he had briefly met at Oxford, Julian Barnes and James Fenton, with whom he had shared a house in Oxford.",
        "It was at this time that the Friday lunches began, which were attended by writers including Clive James, Ian McEwan, Kingsley Amis, Terence Kilmartin, Robert Conquest, Al Alvarez, Peter Porter, Russell Davies and Mark Boxer. At the New Statesman Hitchens acquired a reputation as a left-winger, reporting internationally from areas of conflict such as Northern Ireland, Libya, and Iraq.",
        "In November 1973, Hitchens's mother committed suicide in Athens in a pact with her lover, a defrocked clergyman named Timothy Bryan. The pair overdosed on sleeping pills in adjoining hotel rooms, and Bryan slashed his wrists in the bathtub. Hitchens flew alone to Athens to recover his mother's body, initially under the impression that his mother had been murdered. Both her children were then independent adults. While in Greece, Hitchens reported on the constitutional crisis of the military junta. It became his first leading article for the New Statesman.",
        "In December 1977, Hitchens interviewed Argentine dictator Jorge Rafael Videla, a conversation he later described as 'horrifying'.",
        "In 1977, unhappy at the New Statesman, Hitchens defected to the Daily Express where he became a foreign correspondent. He returned to the New Statesman in 1979 where he became foreign editor."
      ]
    },
    "careerAmerica":
    {
      "type": "article",
      "title": "Journalistic career in American (1981–2011)",
      "content": [
        "Hitchens went to the United States in 1981, as part of an editor exchange programme between the New Statesman and The Nation. After joining The Nation, he penned vociferous critiques of Ronald Reagan, George H. W. Bush and American foreign policy in South and Central America. He became a contributing editor of Vanity Fair in 1992, writing ten columns a year. He left The Nation in 2002 after profoundly disagreeing with other contributors over the Iraq War. There is speculation that Hitchens was the inspiration for Tom Wolfe's character Peter Fallow in the 1987 novel The Bonfire of the Vanities, but others — including Hitchens —believe it to be Spy Magazine's 'Ironman Nightlife Decathlete' Anthony Haden-Guest.[35] In 1987, his father died from cancer of the oesophagus; the same disease that would later claim his own life. In April 2007, Hitchens became a US citizen. He became a media fellow at the Hoover Institution in September 2008. At Slate, he usually wrote under the news-and-politics column named Fighting Words.",
        "Hitchens spent part of his early career in journalism as a foreign correspondent in Cyprus. Through his work there he met his first wife Eleni Meleagrou, a Greek Cypriot, with whom he had two children, Alexander and Sophia. His son, Alexander Meleagrou-Hitchens, born in 1984, has worked as a policy researcher in London. Hitchens continued writing essay-style correspondence pieces from a variety of locales, including Chad, Uganda and the Darfur region of Sudan. His work took him to over 60 countries. In 1991, he received a Lannan Literary Award for Nonfiction.",
        "Hitchens met Carol Blue for the first time at Los Angeles airport in 1989 and married her in 1991. Hitchens called it love at first sight. In 1999, as harsh critics of Clinton, Hitchens and Carol Blue submitted an affidavit to the trial managers of the Republican Party in the impeachment of Bill Clinton. Therein they swore that their then-friend, Sidney Blumenthal, had described Monica Lewinsky as a stalker. This allegation contradicted Blumenthal's own sworn deposition in the trial, and it resulted in a hostile exchange of opinion in the public sphere between Hitchens and Blumenthal. Following the publication of Blumenthal's The Clinton Wars, Hitchens wrote several pieces in which he accused Blumenthal of manipulating the facts. The incident ended their friendship and sparked a personal crisis for Hitchens who was stridently criticised by friends for what they saw as a cynical and ultimately politically futile act.",
        "Before Hitchens's political shift, the American author and polemicist Gore Vidal was apt to speak of Hitchens as his 'dauphin' or 'heir'. In 2010, Hitchens attacked Vidal in a Vanity Fair piece headlined 'Vidal Loco', calling him a 'crackpot' for his adoption of 9/11 conspiracy theories. On the back of Hitchens's memoir Hitch-22, among the praise from notable figures, Vidal's endorsement of Hitchens as his successor is crossed out in red and annotated 'NO, C.H.'' His strong advocacy of the war in Iraq had gained Hitchens a wider readership, and in September 2005 he was named as fifth on the list of the 'Top 100 Public Intellectuals' by Foreign Policy and Prospect magazines. An online poll ranked the 100 intellectuals, but the magazines noted that the rankings of Hitchens , Noam Chomsky , and Abdolkarim Soroush  were partly due to supporters publicising the vote. He later responded to his ranking with a few articles about his status as such."
      ]
    },
    "books":
    {
      "title": "Books",
      "list": [
        "1984 Cyprus. Quartet. Revised editions as Hostage to History: Cyprus from the Ottomans to Kissinger, 1989 (Farrar, Straus & Giroux) and 1997 (Verso)",
        "1987 Imperial Spoils: The Curious Case of the Elgin Marbles , Hill and Wang",
        "1988 Blaming the Victims: Spurious Scholarship and the Palestinian Question (contributor; co-editor with Edward Said) Verso, ISBN 0-86091-887-4 Reissued, 2001",
        "1988 Prepared for the Worst: Selected Essays and Minority Reports Hill and Wang, ISBN 0809078678",
        "1990 The Monarchy: A Critique of Britain's Favorite Fetish, Chatto & Windus Ltd",
        "1990 Blood, Class and Nostalgia: Anglo-American Ironies, Farrar Straus & Giroux (T)(June 1990)",
        "1993 'For The Sake Of Argument' Verso",
        "1995 The Missionary Position: Mother Teresa in Theory and Practice, Verso",
        "1997 The Parthenon Marbles: The Case for Reunification, Verso",
        "1999 No One Left to Lie To: The Values of the Worst Family, original hardcover title: 'No One Left to Lie To: The Triangulations of William Jefferson Clinton,' Verso",
        "2000 Unacknowledged Legislation: Writers in the Public Sphere, Verso",
        "2001 The Trial of Henry Kissinger. Verso",
        "2001 Letters to a Young Contrarian, Basic Books",
        "2002 Why Orwell Matters also Orwell's Victory, Basic Books, ISBN 0-465-03050-5",
        "2003 A Long Short War: The Postponed Liberation of Iraq. Plume/Penguin Group, ISBN 0-452-28498-8",
        "2004 Love, Poverty, and War: Journeys and Essays, Thunder's Mouth, Nation Books, ISBN 1-56025-580-3",
        "2005 Thomas Jefferson: Author of America, Eminent Lives/Atlas Books/HarperCollins Publishers, ISBN 0-06-059896-4",
        "2007 'Thomas Paine's Rights of Man: A Biography ', Atlantic Monthly Press, ISBN 0-87113-955-3",
        "2007 The Portable Atheist: Essential Readings for the Non-Believer, [Editor] Perseus Publishing. ISBN 978-0-306-81608-6",
        "2007 God Is Not Great: How Religion Poisons Everything, Twelve/Hachette Book Group USA/Warner Books, ISBN 0-446-57980-7 / Published in the UK as God is not Great: The Case Against Religion, Atlantic Books, ISBN 978-1-84354-586-6",
        "2008 Christopher Hitchens and His Critics: Terror, Iraq and the Left (with Simon Cottee and Thomas Cushman), New York University Press, ISBN 0814716873",
        "2008 Is Christianity Good for the World? – A Debate (co-author, with Douglas Wilson), Canon Press, ISBN 1-59128-053-2",
        "2010 Hitch-22: A Memoir, Twelve, ISBN 978-0-446-54033-9 OCLC 464590644",
        "2011 Arguably: Essays by Christopher Hitchens, Twelve. UK edition as Arguably: Selected Prose, Atlantic, ISBN 1-4555-0277-4 / ISBN 978-1-4555-0277-6",
        "2012 Mortality, Twelve, ISBN 1-4555-0275-8 / ISBN 978-1-4555-0275-2. UK edition as Mortality, Atlantic Books, ISBN 1-84887-921-0 / ISBN 978-1-84887-921-8",
        "2015 And Yet...: Essays, Simon & Schuster, ISBN 978-1476772066"
      ]
    },
    "videos":
    {
      "talks":
      {
        "title": "Talks",
        "url": "talks url here"
      },
      "interviews":
      {
        "title": "Interviews",
        "url": "interview url here"
      },
      "debates":
      {
        "title": "Debates",
        "url": "debates url here"
      }
    }
  }
}
